roma-cezar/NRF5x_SDK12_GIT/bds_esp8266/main.c
		NRF_GPIOTE->EVENTS_PORT = 0;
    nrf_drv_gpiote_in_event_enable(3, true);
    nrf_drv_gpiote_in_event_enable(4, true);
    nrf_drv_gpiote_in_event_enable(13, true);
    nrf_drv_gpiote_in_event_enable(14, true);
		NVIC_SetPriority(2, GPIOTE_IRQn);
		NVIC_DisableIRQ(GPIOTE_IRQn);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
/**/
static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
	ret_code_t err_code;

	nrf_gpio_pin_toggle(18);
	
	send_flag = true;

	err_code = nrf_drv_rtc_cc_set(
			&m_rtc,
			BLINK_RTC_CC,
			(nrf_rtc_cc_get(m_rtc.p_reg, BLINK_RTC_CC) + BLINK_RTC_TICKS) & RTC_COUNTER_COUNTER_Msk,
			true);
	APP_ERROR_CHECK(err_code);
}
/**/
static void rtc_setup(void)
{
	ret_code_t err_code;
	err_code = nrf_drv_rtc_init(&m_rtc, &m_rtc_config, rtc_handler);
	APP_ERROR_CHECK(err_code);
	err_code = nrf_drv_rtc_cc_set(&m_rtc, BLINK_RTC_CC, BLINK_RTC_TICKS, true);
	APP_ERROR_CHECK(err_code);
	nrf_drv_rtc_enable(&m_rtc);
	SEGGER_RTT_WriteString(0,"RTC started!\r\n");
}
/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;


    // Initialize.
		ESP8266_Serial_Config(115200UL);
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        SEGGER_RTT_WriteString(0, "Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    application_timers_start();
    SEGGER_RTT_WriteString(0, "Bluetooth Dev Studio Start Advertising \r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

		rtc_setup();
		
		counter1=0;
		counter2=0;
		NVIC_EnableIRQ(GPIOTE_IRQn);
    // Enter main loop.
    for (;;)
    {
			if(send_flag)
			{
				memset(get_request, 0 , 256);
				sprintf(get_request, "counter1=%d\r\n", counter1);
				SEGGER_RTT_WriteString(0, get_request);

				memset(get_request, 0 , 256);
				sprintf(get_request, "counter2=%d\r\n\r\n", counter2);
				SEGGER_RTT_WriteString(0, get_request);
				
				ESP8266_Wlan_Start("dd-wrt","bora-bora04");
				wlan_tcp_status = ESP8266_Session_Status();
				if(wlan_tcp_status == 2 || wlan_tcp_status == 4)
				{
						if(ESP8266_Session_Open("SSL", "192.168.1.252", 9443))
						{
							wlan_tcp_status = ESP8266_Session_Status();
							if(wlan_tcp_status == 3)
							{
									memset(get_request, 0 , 256);
									sprintf(get_request, "/22dd4423c4a34bf5b989a6342cc691d6/update/V0?value=%d", counter1);
									ESP8266_GET_Req(get_request);
									
									memset(get_request, 0 , 256);
									sprintf(get_request, "/22dd4423c4a34bf5b989a6342cc691d6/update/V1?value=%d", counter2);
									ESP8266_GET_Req(get_request);
								
									ESP8266_Session_Close();
							}
						}		
				}
				else if(wlan_tcp_status == 5)
				{
					ESP8266_Wlan_Start("dd-wrt","bora-bora04");
				}
				ESP8266_Wlan_Stop();				
				send_flag = !send_flag;
			}
			power_manage();
    }
}

/**
 * @}
 */
